Jackjan4/PhilduinoArduino/hardware/avr/1.0.1/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

# Menu options
menu.clock=Clock
menu.bod=Brown Out Detection
menu.pin5=Pin 5


##############################################################
## Philduino Tiny

philduino-tiny.name=Philduino Tiny

philduino-tiny.upload.protocol=usb
philduino-tiny.upload.tool=micronucleus
philduino-tiny.upload.maximum_size=6522
philduino-tiny.upload.maximum_data_size=512

philduino-tiny.build.mcu=attiny85
philduino-tiny.build.f_cpu=16000000L
philduino-tiny.build.board=AVR_PHILDUINOTINY
philduino-tiny.build.core=tiny
philduino-tiny.build.variant=tiny

philduino-tiny.upload.wait_for_upload_port = false
philduino-tiny.upload.use_1200bps_touch = false
philduino-tiny.upload.disable_flushing = false

philduino-tiny.bootloader.tool=avrdude
philduino-tiny.bootloader.low_fuses=0xE1
philduino-tiny.bootloader.high_fuses=0x5D
philduino-tiny.bootloader.extended_fuses=0xFE
philduino-tiny.bootloader.file=tiny/t85_default.hex


##############################################################
## Philduino Tiny (Expert Mode)

philduino-tiny-exp.name=Philduino Tiny (Expert Mode)

philduino-tiny-exp.upload.protocol=usb
philduino-tiny-exp.upload.tool=micronucleus
philduino-tiny-exp.upload.maximum_size=6522
philduino-tiny-exp.upload.maximum_data_size=512

philduino-tiny-exp.build.mcu=attiny85
philduino-tiny-exp.build.board=AVR_PHILDUINOTINY
philduino-tiny-exp.build.core=tiny
philduino-tiny-exp.build.variant=tiny

# Clock frequencies
philduino-tiny-exp.menu.clock.16_pll=16 MHz Internal PLL (default)
philduino-tiny-exp.menu.clock.16_pll.build.f_cpu=16000000L
philduino-tiny-exp.menu.clock.16_pll.bootloader.low_fuses=0xE1

philduino-tiny-exp.menu.clock.8_rc=8 MHz Internal Calibrated RC
philduino-tiny-exp.menu.clock.8_rc.build.f_cpu=8000000L
philduino-tiny-exp.menu.clock.8_rc.bootloader.low_fuses=0xE2
# This fuse is wrong

#BOD levels
philduino-tiny-exp.menu.bod.dis=Disabled
philduino-tiny-exp.menu.bod.dis.bootloader.low_fuses=0xE1

philduino-tiny-exp.menu.bod.low=1.8V
philduino-tiny-exp.menu.bod.low.bootloader.low_fuses=0xE2

philduino-tiny-exp.menu.bod.medium=2.7V (default)
philduino-tiny-exp.menu.bod.medium.bootloader.low_fuses=0xE2

philduino-tiny-exp.menu.bod.high=4.3V
philduino-tiny-exp.menu.bod.high.bootloader.low_fuses=0xE2

philduino-tiny-exp.upload.wait_for_upload_port = false
philduino-tiny-exp.upload.use_1200bps_touch = false
philduino-tiny-exp.upload.disable_flushing = false

philduino-tiny-exp.bootloader.tool=avrdude
philduino-tiny-exp.bootloader.high_fuses=0x5D
philduino-tiny-exp.bootloader.extended_fuses=0xFE
philduino-tiny-exp.bootloader.file=tiny/t85_default.hex